<?php

use Illuminate\Database\Seeder;
use App\Model\Category;
use App\Model\Product;
use App\Model\ProductCategory;

class dummyDataSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        ########## Category ##########
        //default category
        DB::table('categories')->insert([
            'name' => 'متفرقه',
            'parent_id' => null
        ]);

        $cat_ids = [];
        $categories = ['کت و شلوار','پیراهن','مانتو','کیف و کفش'];
        for ($i = 0; $i < count($categories); $i++) {
            DB::table('categories')->insert([
                'name' => $categories[$i],
                'parent_id' => null
            ]);
            $cat = Category::get(['id'])->last();
            array_push($cat_ids,$cat->id);
        }
        

        ########## Product ##########
        $title = [
            'Wessi کت و شلوار ویسکوز مردانه',
            'Campus کت اسپرت پارچه عدسی',
            'Wessi کت تک ویسکوز مردانه',
            'Simple Wears پیراهن آستین بلند مردانه',
            'Defacto پیراهن پنبه ای مردانه',
            'مانتو لینن تنظیف مدل بی بی جانا',
            'REGAL MEZON مانتو کرپ زنانه',
            'کيف پارچه ای طرح گل زنانه',
            'Amir Shoes نیم بوت دو بر کشی زنانه',
            'کیف دستی میلا'
        ];
        $content= [           
                'در دو طرح ژیله دار و فاقد ژیله 
با بهترین و بروز ترین کیفیت
از بهترین برندهای کت شلوار'
                ,
                'مناسب برای استفاده روزمره
تهیه شده از 80  درصد  الیاف نخی
قابل شستشو با ماشین لباسشویی'
                ,
                'فروش بصورت تک و عمده
پنبه خالص
سایزبندی از 36 تا 48
برای افرادی که دنبال مانتوی ساده و شیک می گردن'
                ,
                'مدل:UGG
سایز 35 در 26
۳ رنگ ژورنال 
بسیار سبک'          
        ];

        $price =[
            455000,385000,240000,
            75000,96000,
            87000,138000,
            65000,115000,48000,
        ];

        $url = 'http://telerobotic.ir/uploads';
        $file=[
            ["$url/c1_p1_i1.jpg","$url/c1_p1_i2.jpg","$url/c1_p1_i3.jpg"],
            ["$url/c1_p2_i1.jpg","$url/c1_p2_i2.jpg","$url/c1_p2_i3.jpg"],
            ["$url/c1_p3_i1.jpg","$url/c1_p3_i2.jpg"],

            ["$url/c2_p1_i1.jpg","$url/c2_p1_i2.jpg","$url/c2_p1_i3.jpg"],
            ["$url/c2_p2_i1.jpg","$url/c2_p2_i2.jpg","$url/c2_p2_i3.jpg"],

            ["$url/c3_p1_i1.jpg","$url/c3_p1_i2.jpg","$url/c3_p1_i3.jpg"],
            ["$url/c3_p2_i1.jpg","$url/c3_p2_i2.jpg"],

            ["$url/c4_p1_i1.jpg","$url/c4_p1_i2.jpg","$url/c4_p1_i3.jpg"],
            ["$url/c4_p2_i1.jpg"],
            ["$url/c4_p3_i1.jpg","$url/c4_p3_i2.jpg","$url/c4_p3_i3.jpg"]
        ];

        for($j = 0 ;$j < 10; $j++){

            if($j<3){
                $desc = $content[0];
                $cat_id = $cat_ids[0];
            }elseif($j<5){
                $desc = $content[1];
                $cat_id = $cat_ids[1];
            }elseif($j<7){
                $desc = $content[2];
                $cat_id = $cat_ids[2];
            }else{
                $desc = $content[3];
                $cat_id = $cat_ids[3];
            }
            
            DB::table('products')->insert([
                'title' => $title[$j],
                'description' => $desc,
                'files' => json_encode($file[$j], JSON_FORCE_OBJECT),
                'price' => $price[$j],
                'status' => true,
            ]);
            $product = Product::get(['id'])->last();
            
            DB::table('product_categories')->insert([
                'cat_id' => $cat_id,
                'product_id' => $product->id
            ]);
        }




        ########## Post & Page ##########
        $contact = '
تماس با دیجی‌کالا
کاربر گرامی، لطفاً در صورت وجود هرگونه سوال یا ابهامی، پیش از ارسال ایمیل یا تماس تلفنی با دیجی‌کالا، بخش پرسش‏های متداول را ملاحظه فرمایید و در صورتی که پاسخ خود را نیافتید، با ما تماس بگیرید.

رسیدگی به انتقادها
مشتری گرامی، اگر انتقاد یا شکایتی از دیجی کالا دارید برای دریافت پاسخ سریع‌تر، لطفا به آدرس complaint@digikala.com ایمیل ارسال کنید .
    
تلفن تماس و فکس:
۶۱۹۳۰۰۰۰ - ۰۲۱   |   ۹٥۱۱۹۰۹٥ - ۰۲۱ 

دفتر مرکزی:
استان تهران - شهر تهران – خیابان ولی‌عصر – بالاتر از میدان ونک – خیابان عطار – میدان عطار – شماره ۴۲ - ساختمان ديجی کالا

مرکز امور مشتریان:
لطفاً برای بازگرداندن کالا و ارسال آن به خدمات پس از فروش دیجی‌کالا از طریق پست، تنها از آدرس زیر استفاده کنید:
صندوق پستی : 3469-15875

ایمیل خدمات پس از فروش: cs@digikala.com 
ایمیل پیگیری سفارش: cc@digikala.com 
ایمیل سازمانی دیجی کالا: info@digikala.com 
        ';
        $about ='دیجی‌کالا بزرگ‌ترین فروشگاه اینترنتی کشور، اینک در آستانه‌ی دهمین سال فعالیت، با گستره‌ای از کالاهای متنوع برای تمام اقشار جامعه و هر رده‌ی سنی، برای کاربران خود «تجربه‌ی لذت‌بخش یک خرید اینترنتی» را تداعی می‌کند. «ارسال سریع»، «ضمانت بهترین قیمت» و «تضمین اصل بودن کالا» سه اصل اولیه است که دیجی‌کالا از نخستین روز تاسیس سعی کرده به آن پایبند باشد و با رعایت این سه اصل، هرسال، حوزه‌های تازه‌ای را در فروش کالا و خدمات، به دایره‌ی فعالیت خود افزوده است. گستره‌ای به وسعت کالای دیجیتال (موبایل، تبلت و کتابخوان‌ها، لپ‌تاپ، کامپیوتر و لوازم جانبی، دوربین، صوتی و تصویری، ماشین‌های اداری و لوازم جانبی کالای دیجیتال)، لوازم خانگی (لوازم برقی، آشپزخانه، سرو و پذیرایی، دکوراتیو، خواب و حمام، شست‌وشو و نظافت و ابزار)، زیبایی و سلامت (عطر، لوازم آرایشی، لوازم بهداشتی، لوازم شخصی برقی، ساعت، زیورآلات، ابزار سلامت)، فرهنگ و هنر (کتاب و مجلات، لوازم‌تحریر، صنایع دستی، آلات موسیقی، موسیقی، فیلم، نرم افزار و بازی و محتوای آموزشی) و ورزش و سرگرمی (لوازم ورزشی، اسباب بازی، تجهیزات سفر و کفش ورزشی)؛ از برندهای متنوع، متعدد و سرشناس جهانی همچون اپل، سونی، سامسونگ، ال‌جی، اچ‌پی، کانن، بوش، نایک، آدیداس، نیوا و ... دیجی‌کالا، یک دهه پس از آغاز فعالیت، با داشتن مراکز توزیع در استان تهران، امکان تحویل کالا را به‌صورت رایگان (در مورد خریدهای بیش از صدهزارتومان) در همان روز ثبت سفارش فراهم کرده است.';

        //blog
        $blog_title=['در مورد گلکسی اس ۹ چه می‌دانیم؟','اپل بدون نیاز به کوالکام گوشی می‌سازد','جدیدترین اطلاعات از تراشه‌ی اسنپ‌دراگون ۸۴۵ لو رفت'];
        $blog_content =[
'تاریخ عرضه‌ی گلکسی اس ۹

اگر سامسونگ مطابق سال‌های گذشته عمل کند، می‌توانیم انتظار معرفی این گوشی را در بین ماه‌های بهمن تا فروردین داشته باشیم. از تاریخ دقیق معرفی این گوشی خبر نداریم، اما سامسونگ از سال ۲۰۱۰ سری گوشی‌های گلکسی اس خود را در بین این ماه‌ها معرفی کرده است.

در حال حاضر به نظر می‌رسد که سامسونگ قصد دارد در کنگره‌ی جهانی موبایل در بارسلونا از این گوشی رونمایی کند. کنگره‌ی امسال در ۸ اسفند کارش را آغاز می‌کند. سایت BGR هم در ماه سپتامبر گزارشی را منتشر کرد که سامسونگ قصد دارد زودتر از معمول هرسال گوشی جدیدش را معرفی کند. به همین خاطر احتمال می‌دهیم که در کنگره‌ی جهانی موبایل امسال، شاهد رونمایی این گوشی خواهیم بود. سایت Forbes هم در گزارشی دیگر مدعی شده که سامسونگ مراسم رونمایی گوشی‌های گلکسی اس ۹ و اس ۹ پلاس را در تاریخ ۷ اسفند برگزار می‌کند و عرضه‌ی این گوشی‌ها در ماه اسفند یا اوایل فروردین آغاز خواهد شد.',

'دعوای حقوقی شکل گرفته بین اپل و کوالکام به ماجرای پیچیده‌ای تبدیل شده است.  در حال حاضر کوالکام قصد دارد جلوی فروش گوشی‌های اپل را در کشور چین بگیرد و اگر این اتفاق رخ بدهد ضربه بزرگی به اپل وارد خواهد شد. این اختلاف‌ها باعث شده که اپل به فکر یک راه چاره باشد. براساس گزارش منتشر شده در سایت Wall Street Journal، اپل در طراحی آیفون‌ و آیپد سال ۲۰۱۸ دیگر از قطعات شرکت کوالکام استفاده نخواهد کرد. گفته شده دو شرکت مدیاتک و اینتل جایگزین کوالکام شده‌اند. در واقع آیفون سال ۲۰۱۸ دیگر از مودم ساخت کوالکام استفاده نخواهد کرد.

اپل همیشه از مودم‌های کوالکام در گوشی‌هایش استفاده می‌کرده که قیمت بسیار گرانی هم داشته‌اند. البته این روند از امسال تغییر کرد و اینتل هم به یکی از سازندگان مودم آیفون تبدیل شد.

شرکت کوالکام ۵۰ درصد بازار ساخت مودم برای گوشی‌های هوشمند را در اختیار دارد. سهم شرکت مدیاتک هم ۲۵ درصد است و اینتل تنها ۶ درصد این بازار را در اختیار دارد. سال گذشته اپل ۲۰ درصد از تولید مودم‌های کوالکام را با مبلغ ۳٫۲ میلیارد دلار خریداری کرد. از امسال که اینتل هم به یکی از تولید کننده‌های مودم برای آیفون شد، درآمد کوالکام به ۲٫۱ میلیارد دلار کاهش پیدا کرد.

البته شرکت کوالکام برنامه‌ریزی کرده که جزو اولین شرکت‌هایی باشد که مودم‌ ۵G را برای گوشی‌های هوشمند تولید می‌کند و حتی شایعه شده که اولین آیفون با مودم ۵G در سال ۲۰۱۹ راهی بازار می‌شود.',

'احتمالا همان‌طور که در جریان اخبار اخیر باشید، شنیده‌اید که به زودی اسنپ‌دراگون ۸۴۵ به بازار عرضه می‌شود. گرچه شرکت کوالکام در تلاش بود که اطلاعات تراشه‌ی پرچم‌دار خودش لو نرود اما گزارش‌های جدید برنامه‌ی کوالکام را نقش بر آب کردند!

تراشه‌ی اسنپ‌دراگون ۸۴۵ احتمالا در تاریخ ۴ دسامبر در هاوایی معرفی می‌شود. این تراشه از ۴ پردازنده‌ی Cortex-A75 و ۴ پردازنده‌ی Cortex-A53 بهره می‌برد. نتیجه‌ی این اقدام کوالکام، افزایش عملکرد ۲۵ درصدی نسبت به اسنپ‌دراگون ۸۳۵ است. به نظر می‌رسد که این تراشه از معماری ۱۰ نیوتون‌متری LPE  (Low Power Early) بهره‌مند شده که باعث کم‌شدن مصرف انرژی آن می‌شود. هم‌چنین از دیگر فناوری‌های این تراشه به LPP  سامسونگ اشاره شده که عملکرد و کارآیی آن به‌طرز چشم‌گیری بیشتر شده است.'
        ];

        $url = 'http://telerobotic.ir/uploads';
        $blog_thumb=["$url/blog_thumb1.jpg", "$url/blog_thumb2.jpg", "$url/blog_thumb3.jpg"];

        for ($p = 0; $p<5; $p++) {
            if($p < 2){
                $type = 'page';
                $title = $p < 1 ? 'درباره ما' : 'تماس با ما';
                $content = $p < 1 ? $about : $contact;
                $thumb = 'http://telerobotic.ir/uploads/logo.png';
            }else{
                $type = 'blog';
                $title = $blog_title[$p-2];
                $content = $blog_content[$p-2];
                $thumb = $blog_thumb[$p-2];
            }
        
        DB::table('posts')->insert([
            'title' => $title,
            'thumb' => $thumb,
            'content' => $content,
            'type' => $type,
            'status' => true,
        ]);
        }

    }
}
