----------------------------------------
    درصورت اطمیان از تصمیم خود برای انصراف به نکات ذیل توجه کنید:
    هزینه برگشتی برای ماههای باقیمانده مقدور است.
    هزینه برگشتی برای اعتبار بیش از 6 ماه <code>70%</code> و برای 6 ماه و کمتر  <code>50%</code> می باشد.
    اگر اعتبار شما <b>کمتر</b> از یک ماه است امکان انصراف ندارید.
    در صورت نیاز همکاران ما در اسرع وقت با شما تماس خواهند گرفت.
    @if($diff->invert==0 &&( $diff->y>0|| $diff->m>5))
    @else
----------------------------------------
  🔴  امکان انصراف برای شما  مقدور نمی باشد.

  🔴  درصورت مصمم بودن ربات خود را حذف کنید.
    @endif
----------------------------------------