{
    "keyboard": [
        [
            {
                "text": "مدیریت محصولات"
            },
            {
                "text": "مدیریت دسته ها"
            }
        ],
        [
            {
                "text": "مدیریت صفحات"
            },
            {
                "text": "مدیریت بلاگ"
            }
        ],
        [
            {
                "text":"آموزش کار با پنل"
            },
            {
                "text":"اطلاع رسانی"
            }
        ],
        [
            {
                "text":"خروج از مدیریت"
            },
            {
                "text":"مدیریت گزارشات"
            }
        ]
    ],
    "resize_keyboard": true
}